DataProcessors/БанковскаяВыписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>БанковскаяВыписка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСовершенияОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОбработкиОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАвторизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГородСовершения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаСовершения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеСчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ВыпискиИзБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыпискиИзБанков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыпискиИзБанков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородСовершения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/БанковскаяВыписка/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыпискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие) ;
	Проводник.Заголовок = "Выберите банковскую выписку";
	Фильтр = "ТекстовыйДокумент (*.csv)|*.csv";        
	Проводник.Фильтр = Фильтр ;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект) ;
	Проводник.Показать(Оповещение) ; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат ;
	КонецЕсли ;
	
	Объект.Выписка = ВыбранныеФайлы[0] ;

КонецПроцедуры 

&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресДанных)
	Объект.ДанныеФайла.Очистить();
	ПоследовательноеЧтение = Истина ;
	Если ПоследовательноеЧтение Тогда
		Текст = Новый ЧтениеТекста ;
		Данные = ПолучитьИзВременногоХранилища(АдресДанных) ;
		ВыпискаНаСервере = ПолучитьИмяВременногоФайла("csv") ;
		Данные.Записать(ВыпискаНаСервере);
		
		Текст.Открыть(ВыпискаНаСервере) ;  
		ТекСтрока = Текст.ПрочитатьСтроку() ;
		ТекСтрока = Текст.ПрочитатьСтроку() ;
		Пока ТекСтрока <> Неопределено Цикл
			МассивСлов = СтрРазделить(ТекСтрока, ";") ;
			НоваяСтрока = Объект.ДанныеФайла.Добавить() ;
			НоваяСтрока.ТипКарты = МассивСлов[0] ;
			НоваяСтрока.НомерКарты = МассивСлов[1] ;
			НоваяСтрока.ДатаСовершенияОперации =  Дата(Прав(МассивСлов[2],4)+Сред(МассивСлов[2],4,2)+Лев(МассивСлов[2],2)+"000000");
			НоваяСтрока.ДатаОбработкиОперации = Дата(Прав(МассивСлов[3],4)+Сред(МассивСлов[3],4,2)+Лев(МассивСлов[3],2)+"000000");
			НоваяСтрока.КодАвторизации = МассивСлов[4] ;
			НоваяСтрока.ТипОперации = МассивСлов[5] ;
			НоваяСтрока.ГородСовершения = МассивСлов[6] ;
			НоваяСтрока.СтранаСовершения = МассивСлов[7] ;
			НоваяСтрока.Описание = МассивСлов[8] ;
			НоваяСтрока.ВалютаОперации = МассивСлов[9] ;
			НоваяСтрока.СуммаВВалютеОперации = МассивСлов[10] ;
			НоваяСтрока.СуммаВВалютеСчета = МассивСлов[11] ;
			ТекСтрока = Текст.ПрочитатьСтроку() ;	
		КонецЦикла ;
	КонецЕсли ;
КонецПроцедуры         

&НаКлиенте
Процедура ПрочитатьФайл(Команда) 
	ДанныеФайла = Новый ДвоичныеДанные(Объект.Выписка) ;
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеФайла) ;
	ПрочитатьФайлНаСервере(АдресДанных);
КонецПроцедуры  

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	МассивКод = Новый Массив;
	Для каждого СтрокаДанных Из Объект.Данныефайла Цикл
		МассивКод.Добавить(СтрокаДанных.КодАвторизации);
	КонецЦикла ; 
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпискиИзБанков.Ссылка КАК Ссылка,
		|	ВыпискиИзБанков.КодАвторизации КАК КодАвторизации
		|ИЗ
		|	Документ.ВыпискиИзБанков КАК ВыпискиИзБанков
		|ГДЕ
		|	ВыпискиИзБанков.КодАвторизации В(&МассивКод)";
		
	Запрос.УстановитьПараметр ("МассивКод", МассивКод) ;
	РезультатЗапроса = Запрос.Выполнить() ;
	ТаблицаВыписки = РезультатЗапроса.Выгрузить() ;
	Для каждого СтрокаДанных Из Объект.ДанныеФайла Цикл
		НайденныйКод = ТаблицаВыписки.Найти(СтрокаДанных.КодАвторизации, "КодАвторизации");
		Если НайденныйКод <> Неопределено Тогда
			Продолжить;
		КонецЕсли ;   
		НоваяВыписка = Документы.ВыпискиИзБанков.СоздатьДокумент();
		НоваяВыписка.НомерКарты = СтрокаДанных.НомерКарты;
		НоваяВыписка.Дата = СтрокаДанных.ДатаСовершенияОперации;
		НоваяВыписка.КодАвторизации = СтрокаДанных.КодАвторизации;
		НоваяВыписка.ГородСовершения = СтрокаДанных.ГородСовершения;  
		НоваяВыписка.Описание = СтрокаДанных.Описание;
		НоваяВыписка.СуммаВВалютеСчета = СтрокаДанных.СуммаВВалютеСчета ;
		НоваяВыписка.Записать() ;
	КонецЦикла;
	Сообщить("Операции записаны") ;
		
КонецПроцедуры
